src/main/test/supply-chain/4-Finalization/1-Control Tax/0-ControlTax/10-TC_01_05_11_same_TDS_matchingLevel=DeviationDecimal/7-TC_01_05_11_same_TDS_matchingLevel=DeviationDecimal-4.2/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:con="http://controlTax.ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <con:controlTax>
         <!--Optional:-->
         <arg0>
            <DocumentId>
               <SystemSourceId>ICI001</SystemSourceId>
               <TransactionId>1000154332</TransactionId>
            </DocumentId>
            <AlternateDocumentId>
               <CustomField1>TEST10_RIX4-N</CustomField1>
               <CustomField2/>
               <CustomField3/>
               <CustomField4/>
               <CustomField5/>
               <CustomField6/>
               <CustomField7/>
               <CustomField8/>
               <CustomField9/>
               <CustomField10>TEST</CustomField10>
            </AlternateDocumentId>
            <InvoiceLanguage>
               <LanguageCode>en</LanguageCode>
               <LanguageCountryCode>GB</LanguageCountryCode>
            </InvoiceLanguage>
            <CommunicationLanguage>
               <LanguageCode>en</LanguageCode>
               <LanguageCountryCode>GB</LanguageCountryCode>
            </CommunicationLanguage>
            <GrossPriceCalculation>N</GrossPriceCalculation>
            <PriceType>net</PriceType>
            <PreviousInvoiceTaxCountry>GB</PreviousInvoiceTaxCountry>
            <TaxDecisionSet>
               <TaxDecisionSetId>1</TaxDecisionSetId>
               <SellerTaxIndicator>
                  <TaxIndicatorAbbreviation>MAT_DOM</TaxIndicatorAbbreviation>
                  <TaxIndicatorName>Domestic Tax</TaxIndicatorName>
                  <TaxIndicatorComment>Domestic transaction</TaxIndicatorComment>
               </SellerTaxIndicator>
               <SellerTaxCountry>GB</SellerTaxCountry>
               <SellerTaxState>NULL</SellerTaxState>
               <BuyerTaxIndicator>
                  <TaxIndicatorAbbreviation>MAT_DOM</TaxIndicatorAbbreviation>
                  <TaxIndicatorName/>
                  <TaxIndicatorComment/>
               </BuyerTaxIndicator>
               <BuyerTaxCountry>GB</BuyerTaxCountry>
               <BuyerTaxState>NULL</BuyerTaxState>
               <CombinedTaxIndicator>DOM</CombinedTaxIndicator>
               <CommercialIndicator>C</CommercialIndicator>
               <SellerTaxRegCountry>GB</SellerTaxRegCountry>
               <SellerTaxRegState>NULL</SellerTaxRegState>
               <BuyerTaxRegCountry>GB</BuyerTaxRegCountry>
               <BuyerTaxRegState>NULL</BuyerTaxRegState>
               <SellerTaxTotal>
                  <NetAmount>8.00</NetAmount>
                  <TaxAmount>0.00</TaxAmount>
                  <GrossAmount>8.00</GrossAmount>
                  <TaxAmountInLocalCurrency>0</TaxAmountInLocalCurrency>
                  <TaxInvoiceSubTotal>
                     <TaxType>
                        <TaxTypeName>DV</TaxTypeName>
                        <TaxTypeAbbreviation>VAT</TaxTypeAbbreviation>
                        <TaxTypeDescription>VALUE ADDED TAX</TaxTypeDescription>
                     </TaxType>
                     <TaxCode>N</TaxCode>
                     <TaxRate>0.0000</TaxRate>
                     <NetAmount>8.00</NetAmount>
                     <TaxAmount>0.00</TaxAmount>
                     <GrossAmount>8.00</GrossAmount>
                     <TaxAmountInLocalCurrency>0</TaxAmountInLocalCurrency>
                  </TaxInvoiceSubTotal>
               </SellerTaxTotal>
               <BuyerTaxTotal>
                  <NetAmount>7.00</NetAmount>
                  <TaxAmount>0.00</TaxAmount>
                  <GrossAmount>8.00</GrossAmount>
                  <TaxAmountInLocalCurrency/>
                  <TaxInvoiceSubTotal>
                     <TaxType>
                        <TaxTypeName>DV</TaxTypeName>
                        <TaxTypeAbbreviation>VAT</TaxTypeAbbreviation>
                        <TaxTypeDescription>VALUE ADDED TAX</TaxTypeDescription>
                     </TaxType>
                     <TaxCode>N</TaxCode>
                     <TaxRate>0.0000</TaxRate>
                     <NetAmount>8.00</NetAmount>
                     <TaxAmount>0.00</TaxAmount>
                     <GrossAmount>8.00</GrossAmount>
                     <TaxAmountInLocalCurrency/>
                  </TaxInvoiceSubTotal>
               </BuyerTaxTotal>
               <InvoiceCurrency>
                  <CurrencyCode>EUR</CurrencyCode>
                  <SellerLocalTaxCurrencyCode>GBP</SellerLocalTaxCurrencyCode>
                  <BuyerLocalTaxCurrencyCode/>
               </InvoiceCurrency>
               <LegalTaxCalculationLevel>G</LegalTaxCalculationLevel>
               <TaxInvoiceLine>
                  <LineNumber>1</LineNumber>
                  <ItemNo>30151672</ItemNo>
                  <ItemType>ART</ItemType>
                  <UNSPSC>56000000</UNSPSC>
                  <Classification>M</Classification>
                  <SubClassification>GOODS</SubClassification>
                  <NetAmount>8.00</NetAmount>
                  <SellerTax>
                     <SellerTaxCountry>
                        <TaxCalculationLineComponent>
                           <TaxAmount>0.00</TaxAmount>
                           <ItemTaxAmount/>
                           <GrossAmount>8.00</GrossAmount>
                           <ItemGrossAmount/>
                           <NetAmount>8.00</NetAmount>
                           <ItemNetAmount/>
                           <TaxAmountInLocalCurrency>0</TaxAmountInLocalCurrency>
                           <ItemTaxAmountInLocalCurrency/>
                           <TaxCode>N</TaxCode>
                           <TaxType>
                              <TaxTypeName>DV</TaxTypeName>
                              <TaxTypeAbbreviation>VAT</TaxTypeAbbreviation>
                              <TaxTypeDescription>VALUE ADDED TAX</TaxTypeDescription>
                           </TaxType>
                           <TaxRate>0.0000</TaxRate>
                           <CalculationRule>RateOnNet</CalculationRule>
                        </TaxCalculationLineComponent>
                     </SellerTaxCountry>
                  </SellerTax>
                  <BuyerTax>
                     <BuyerTaxCountry>
                        <TaxCalculationLineComponent>
                           <TaxAmount>0.00</TaxAmount>
                           <ItemTaxAmount/>
                           <GrossAmount>8.00</GrossAmount>
                           <ItemGrossAmount/>
                           <NetAmount>8.00</NetAmount>
                           <ItemNetAmount/>
                           <TaxAmountInLocalCurrency/>
                           <ItemTaxAmountInLocalCurrency/>
                           <TaxCode>N</TaxCode>
                           <TaxType>
                              <TaxTypeName>DV</TaxTypeName>
                              <TaxTypeAbbreviation>VAT</TaxTypeAbbreviation>
                              <TaxTypeDescription>VALUE ADDED TAX</TaxTypeDescription>
                           </TaxType>
                           <TaxRate>0.0000</TaxRate>
                           <CalculationRule>RateOnNet</CalculationRule>
                        </TaxCalculationLineComponent>
                     </BuyerTaxCountry>
                  </BuyerTax>
                  <VariableTaxSteeringInput>
                     <ConsignorCountry/>
                     <ConsignorState/>
                     <ConsignorBusinessUnitCode/>
                     <ConsignorBusinessUnitType/>
                     <ConsigneeCountry/>
                     <ConsigneeState/>
                     <ConsigneeBusinessUnitCode/>
                     <ConsigneeBusinessUnitType/>
                     <ShipmentStartCountry/>
                     <ShipmentEndCountry/>
                     <ShipmentStartState/>
                     <ShipmentEndState/>
                     <ServiceRenderedCountry/>
                     <ServiceRenderedState/>
                     <ResalePurpose/>
                     <IsOutBonded/>
                     <IsInBonded/>
                     <TaxPreAlgorithmOutput>
                        <IsExport/>
                        <IsImport/>
                        <IsExported/>
                        <IsImported/>
                     </TaxPreAlgorithmOutput>
                     <ShippingOfCustomsClearedGoods/>
                  </VariableTaxSteeringInput>
               </TaxInvoiceLine>
               <SellerTaxInformation>
                  <TaxRegistration>
                     <TaxRegistrationCountry>GB</TaxRegistrationCountry>
                     <TaxRegistrationNumberType>DV</TaxRegistrationNumberType>
                     <TaxRegistrationNumber>GB894 4222 05</TaxRegistrationNumber>
                  </TaxRegistration>
                  <TaxRepresentative/>
               </SellerTaxInformation>
               <BuyerTaxInformation>
                  <TaxRegistration>
                     <TaxRegistrationCountry>GB</TaxRegistrationCountry>
                     <TaxRegistrationNumberType>DV</TaxRegistrationNumberType>
                     <TaxRegistrationNumber>GB527 7733 20</TaxRegistrationNumber>
                  </TaxRegistration>
                  <TaxRepresentative/>
               </BuyerTaxInformation>
            </TaxDecisionSet>
            <TaxDecisionSet>
               <TaxDecisionSetId>2</TaxDecisionSetId>
               <SellerTaxIndicator>
                  <TaxIndicatorAbbreviation>SER_NOTAXRC</TaxIndicatorAbbreviation>
                  <TaxIndicatorName>No Tax - Reverse Charge</TaxIndicatorName>
                  <TaxIndicatorComment>VAT reverse charge mechanism applicable (buyer accounts for VAT)</TaxIndicatorComment>
               </SellerTaxIndicator>
               <SellerTaxCountry>CH</SellerTaxCountry>
               <SellerTaxState>NULL</SellerTaxState>
               <BuyerTaxIndicator>
                  <TaxIndicatorAbbreviation>SER_RC</TaxIndicatorAbbreviation>
                  <TaxIndicatorName/>
                  <TaxIndicatorComment/>
               </BuyerTaxIndicator>
               <BuyerTaxCountry>GB</BuyerTaxCountry>
               <BuyerTaxState>NULL</BuyerTaxState>
               <CombinedTaxIndicator>SRC</CombinedTaxIndicator>
               <CommercialIndicator>C</CommercialIndicator>
               <SellerTaxRegCountry>CH</SellerTaxRegCountry>
               <SellerTaxRegState>NULL</SellerTaxRegState>
               <BuyerTaxRegCountry>GB</BuyerTaxRegCountry>
               <BuyerTaxRegState>NULL</BuyerTaxRegState>
               <SellerTaxTotal>
                  <NetAmount>8.00</NetAmount>
                  <TaxAmount/>
                  <GrossAmount>8.00</GrossAmount>
                  <TaxAmountInLocalCurrency/>
               </SellerTaxTotal>
               <BuyerTaxTotal>
                  <NetAmount>8.00</NetAmount>
                  <TaxAmount>1.60</TaxAmount>
                  <GrossAmount>9.60</GrossAmount>
                  <TaxAmountInLocalCurrency/>
                  <TaxInvoiceSubTotal>
                     <TaxType>
                        <TaxTypeName>DV</TaxTypeName>
                        <TaxTypeAbbreviation>VAT</TaxTypeAbbreviation>
                        <TaxTypeDescription>VALUE ADDED TAX</TaxTypeDescription>
                     </TaxType>
                     <TaxCode>0</TaxCode>
                     <TaxRate>20.0000</TaxRate>
                     <NetAmount>8.00</NetAmount>
                     <TaxAmount>1.60</TaxAmount>
                     <GrossAmount>9.60</GrossAmount>
                     <TaxAmountInLocalCurrency/>
                  </TaxInvoiceSubTotal>
               </BuyerTaxTotal>
               <InvoiceCurrency>
                  <CurrencyCode>EUR</CurrencyCode>
                  <SellerLocalTaxCurrencyCode/>
                  <BuyerLocalTaxCurrencyCode/>
               </InvoiceCurrency>
               <LegalTaxCalculationLevel>G</LegalTaxCalculationLevel>
               <TaxInvoiceLine>
                  <LineNumber>2</LineNumber>
                  <ItemNo>90138098</ItemNo>
                  <ItemType/>
                  <UNSPSC>78000000</UNSPSC>
                  <Classification>S</Classification>
                  <SubClassification>FREIGHT</SubClassification>
                  <NetAmount>8.00</NetAmount>
                  <SellerTax/>
                  <BuyerTax>
                     <BuyerTaxCountry>
                        <TaxCalculationLineComponent>
                           <TaxAmount>1.60</TaxAmount>
                           <ItemTaxAmount/>
                           <GrossAmount>9.60</GrossAmount>
                           <ItemGrossAmount/>
                           <NetAmount>8.00</NetAmount>
                           <ItemNetAmount/>
                           <TaxAmountInLocalCurrency/>
                           <ItemTaxAmountInLocalCurrency/>
                           <TaxCode>0</TaxCode>
                           <TaxType>
                              <TaxTypeName>DV</TaxTypeName>
                              <TaxTypeAbbreviation>VAT</TaxTypeAbbreviation>
                              <TaxTypeDescription>VALUE ADDED TAX</TaxTypeDescription>
                           </TaxType>
                           <TaxRate>20.0000</TaxRate>
                           <CalculationRule>RateOnNet</CalculationRule>
                        </TaxCalculationLineComponent>
                     </BuyerTaxCountry>
                  </BuyerTax>
                  <VariableTaxSteeringInput>
                     <ConsignorCountry/>
                     <ConsignorState/>
                     <ConsignorBusinessUnitCode/>
                     <ConsignorBusinessUnitType/>
                     <ConsigneeCountry/>
                     <ConsigneeState/>
                     <ConsigneeBusinessUnitCode/>
                     <ConsigneeBusinessUnitType/>
                     <ShipmentStartCountry/>
                     <ShipmentEndCountry/>
                     <ShipmentStartState/>
                     <ShipmentEndState/>
                     <ServiceRenderedCountry/>
                     <ServiceRenderedState/>
                     <ResalePurpose/>
                     <IsOutBonded/>
                     <IsInBonded/>
                     <TaxPreAlgorithmOutput>
                        <IsExport/>
                        <IsImport/>
                        <IsExported/>
                        <IsImported/>
                     </TaxPreAlgorithmOutput>
                     <ShippingOfCustomsClearedGoods/>
                  </VariableTaxSteeringInput>
               </TaxInvoiceLine>
               <SellerTaxInformation>
                  <TaxRegistration>
                     <TaxRegistrationCountry>CH</TaxRegistrationCountry>
                     <TaxRegistrationNumberType>DV</TaxRegistrationNumberType>
                     <TaxRegistrationNumber>CHE 106816182MWST</TaxRegistrationNumber>
                  </TaxRegistration>
                  <TaxRepresentative/>
               </SellerTaxInformation>
               <BuyerTaxInformation>
                  <TaxRegistration>
                     <TaxRegistrationCountry>GB</TaxRegistrationCountry>
                     <TaxRegistrationNumberType>DV</TaxRegistrationNumberType>
                     <TaxRegistrationNumber>GB527 7733 20</TaxRegistrationNumber>
                  </TaxRegistration>
                  <TaxRepresentative/>
               </BuyerTaxInformation>
            </TaxDecisionSet>
            <TaxDate>
               <TaxAlgorithmDate>2017-08-11</TaxAlgorithmDate>
               <TaxCalculationDate>2017-08-11</TaxCalculationDate>
            </TaxDate>
            <TaxModuleBehaviour>
               <SkipCalculation>N</SkipCalculation>
               <SkipDecision>N</SkipDecision>
            </TaxModuleBehaviour>
            <VariableTaxSteeringInput>
               <ConsignorCountry>GB</ConsignorCountry>
               <ConsignorBusinessUnitCode>320</ConsignorBusinessUnitCode>
               <ConsignorBusinessUnitType>DT</ConsignorBusinessUnitType>
               <ConsigneeCountry>GB</ConsigneeCountry>
               <ConsigneeState>GBCRY</ConsigneeState>
               <ConsigneeBusinessUnitCode>144</ConsigneeBusinessUnitCode>
               <ConsigneeBusinessUnitType>STO</ConsigneeBusinessUnitType>
               <ShipmentStartCountry>GB</ShipmentStartCountry>
               <ShipmentEndCountry>GB</ShipmentEndCountry>
               <ShipmentEndState>GBCRY</ShipmentEndState>
               <ServiceRenderedCountry/>
               <ServiceRenderedState/>
               <ResalePurpose>Y</ResalePurpose>
               <IsOutBonded>N</IsOutBonded>
               <IsInBonded>N</IsInBonded>
               <TaxPreAlgorithmOutput>
                  <IsExport>N</IsExport>
                  <IsImport>N</IsImport>
                  <IsExported>N</IsExported>
                  <IsImported>N</IsImported>
               </TaxPreAlgorithmOutput>
               <ShippingOfCustomsClearedGoods>Y</ShippingOfCustomsClearedGoods>
            </VariableTaxSteeringInput>
            <BuyerParty>
               <Party>
                  <BusinessUnitCode>1840</BusinessUnitCode>
                  <BusinessUnitType>COM</BusinessUnitType>
                  <BusinessUnitName/>
                  <PartyAddress>
                     <AddressType>M</AddressType>
                     <City>LONDON</City>
                     <Street>255 North Circular Road</Street>
                     <ZipCode>NW10 0JQ</ZipCode>
                     <CountryCode>GB</CountryCode>
                     <CountryOfLegalRegistration>GB</CountryOfLegalRegistration>
                  </PartyAddress>
               </Party>
            </BuyerParty>
            <SellerParty>
               <Party>
                  <BusinessUnitCode>5100</BusinessUnitCode>
                  <BusinessUnitType>COM</BusinessUnitType>
                  <BusinessUnitName/>
                  <PartyAddress>
                     <AddressType>M</AddressType>
                     <City>Pratteln</City>
                     <Street>Grössenweg 15</Street>
                     <ZipCode>4133</ZipCode>
                     <CountryCode>CH</CountryCode>
                     <CountryOfLegalRegistration>CH</CountryOfLegalRegistration>
                  </PartyAddress>
               </Party>
            </SellerParty>
            <TermOfDelivery/>
         </arg0>
      </con:controlTax>
   </soap:Body>
</soap:Envelope>